app/controllers/static_pages_controller.rb

    def home
        @first_posts = Post.find(1);
        @other_posts = Post.where.not(id: 1);
        @category = Category.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories"